apache/nuttx/arch/arm/src/common/stm32/stm32_pwm_m3m4_v1v2v3.c
/****************************************************************************
 * arch/arm/src/common/stm32/stm32_pwm_m3m4_v1v2v3.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdint.h>
#include <stdio.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32_pwm.h"
#include "stm32_rcc.h"
#include "stm32_gpio.h"

/* This module then only compiles if there is at least one enabled timer
 * intended for use with the PWM upper half driver.
 *
 * It implements support for both:
 *   1. STM32 TIMER IP version 1 - F0, F1, F2, F37x, F4, L0, L1
 *   2. STM32 TIMER IP version 2 - F3 (no F37x), F7, H7, L4, L4+
 */

#ifdef CONFIG_STM32_PWM

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* PWM/Timer Definitions ****************************************************/

/* The following definitions are used to identify the various time types.
 * There are some differences in timer types across STM32 families:
 *   - TIM2 is 16-bit timer for F1, L1 and L0
 *   - TIM5 is 16-bit timer for F1
 */

#define TIMTYPE_BASIC        0  /* Basic timers (no outputs) */
#define TIMTYPE_GENERAL16    1  /* General 16-bit timers (up, down, up/down)*/
#define TIMTYPE_COUNTUP16    2  /* General 16-bit count-up timers */
#define TIMTYPE_COUNTUP16_N  3  /* General 16-bit count-up timers with
                                 * complementary outputs
                                 */
#define TIMTYPE_GENERAL32    4  /* General 32-bit timers (up, down, up/down)*/
#define TIMTYPE_ADVANCED     5  /* Advanced timers */

#define TIMTYPE_TIM1       TIMTYPE_ADVANCED
#if defined(CONFIG_STM32_STM32L15XX) || defined(CONFIG_STM32_STM32F10XX)
#  define TIMTYPE_TIM2     TIMTYPE_GENERAL16
#else
#  define TIMTYPE_TIM2     TIMTYPE_GENERAL32
#endif
#define TIMTYPE_TIM3       TIMTYPE_GENERAL16
#define TIMTYPE_TIM4       TIMTYPE_GENERAL16
#if defined(CONFIG_STM32_STM32F10XX)
#  define TIMTYPE_TIM5     TIMTYPE_GENERAL16
#else
#  define TIMTYPE_TIM5     TIMTYPE_GENERAL32
#endif
#define TIMTYPE_TIM6       TIMTYPE_BASIC
#define TIMTYPE_TIM7       TIMTYPE_BASIC
#define TIMTYPE_TIM8       TIMTYPE_ADVANCED
#define TIMTYPE_TIM9       TIMTYPE_COUNTUP16
#define TIMTYPE_TIM10      TIMTYPE_COUNTUP16
#define TIMTYPE_TIM11      TIMTYPE_COUNTUP16
#define TIMTYPE_TIM12      TIMTYPE_COUNTUP16
#define TIMTYPE_TIM13      TIMTYPE_COUNTUP16
#define TIMTYPE_TIM14      TIMTYPE_COUNTUP16
#define TIMTYPE_TIM15      TIMTYPE_COUNTUP16_N /* Treated as ADVTIM */
#define TIMTYPE_TIM16      TIMTYPE_COUNTUP16_N /* Treated as ADVTIM */
#define TIMTYPE_TIM17      TIMTYPE_COUNTUP16_N /* Treated as ADVTIM */

/* Timer clock source, RCC EN offset, enable bit,
 * RCC RST offset, reset bit to use
 *
 * TODO: simplify this and move somewhere else.
 */

#if defined(CONFIG_STM32_STM32F37XX)
#  define TIMCLK_TIM2      STM32_TIM2_CLKIN
#  define TIMRCCEN_TIM2    STM32_RCC_APB1ENR
#  define TIMEN_TIM2       RCC_APB1ENR_TIM2EN
#  define TIMRCCRST_TIM2   STM32_RCC_APB1RSTR
#  define TIMRST_TIM2      RCC_APB1RSTR_TIM2RST
#  define TIMCLK_TIM3      STM32_TIM3_CLKIN
#  define TIMRCCEN_TIM3    STM32_RCC_APB1ENR
#  define TIMEN_TIM3       RCC_APB1ENR_TIM3EN
#  define TIMRCCRST_TIM3   STM32_RCC_APB1RSTR
#  define TIMRST_TIM3      RCC_APB1RSTR_TIM3RST
#  define TIMCLK_TIM4      STM32_TIM4_CLKIN
#  define TIMRCCEN_TIM4    STM32_RCC_APB1ENR
#  define TIMEN_TIM4       RCC_APB1ENR_TIM4EN
#  define TIMRCCRST_TIM4   STM32_RCC_APB1RSTR
#  define TIMRST_TIM4      RCC_APB1RSTR_TIM4RST
#  define TIMCLK_TIM5      STM32_TIM5_CLKIN
#  define TIMRCCEN_TIM5    STM32_RCC_APB1ENR
#  define TIMEN_TIM5       RCC_APB1ENR_TIM5EN
#  define TIMRCCRST_TIM5   STM32_RCC_APB1RSTR
#  define TIMRST_TIM5      RCC_APB1RSTR_TIM5RST
#  define TIMCLK_TIM6      STM32_TIM6_CLKIN
#  define TIMRCCEN_TIM6    STM32_RCC_APB1ENR
#  define TIMEN_TIM6       RCC_APB1ENR_TIM6EN
#  define TIMRCCRST_TIM6   STM32_RCC_APB1RSTR
#  define TIMRST_TIM6      RCC_APB1RSTR_TIM6RST
#  define TIMCLK_TIM7      STM32_TIM7_CLKIN
#  define TIMRCCEN_TIM7    STM32_RCC_APB1ENR
#  define TIMEN_TIM7       RCC_APB1ENR_TIM7EN
#  define TIMRCCRST_TIM7   STM32_RCC_APB1RSTR
#  define TIMRST_TIM7      RCC_APB1RSTR_TIM7RST
#  define TIMCLK_TIM12     STM32_TIM12_CLKIN
#  define TIMRCCEN_TIM12   STM32_RCC_APB1ENR
#  define TIMEN_TIM12      RCC_APB1ENR_TIM12EN
#  define TIMRCCRST_TIM12  STM32_RCC_APB1RSTR
#  define TIMRST_TIM12     RCC_APB1RSTR_TIM12RST
#  define TIMCLK_TIM13     STM32_TIM13_CLKIN
#  define TIMRCCEN_TIM13   STM32_RCC_APB1ENR
#  define TIMEN_TIM13      RCC_APB1ENR_TIM13EN
#  define TIMRCCRST_TIM13  STM32_RCC_APB1RSTR
#  define TIMRST_TIM13     RCC_APB1RSTR_TIM13RST
#  define TIMCLK_TIM14     STM32_TIM14_CLKIN
#  define TIMRCCEN_TIM14   STM32_RCC_APB1ENR
#  define TIMEN_TIM14      RCC_APB1ENR_TIM14EN
#  define TIMRCCRST_TIM14  STM32_RCC_APB1RSTR
#  define TIMRST_TIM14     RCC_APB1RSTR_TIM14RST
#  define TIMCLK_TIM15     STM32_TIM15_CLKIN
#  define TIMRCCEN_TIM15   STM32_RCC_APB2ENR
#  define TIMEN_TIM15      RCC_APB2ENR_TIM15EN
#  define TIMRCCRST_TIM15  STM32_RCC_APB2RSTR
#  define TIMRST_TIM15     RCC_APB2RSTR_TIM15RST
#  define TIMCLK_TIM16     STM32_TIM16_CLKIN
#  define TIMRCCEN_TIM16   STM32_RCC_APB2ENR
#  define TIMEN_TIM16      RCC_APB2ENR_TIM16EN
#  define TIMRCCRST_TIM16  STM32_RCC_APB2RSTR
#  define TIMRST_TIM16     RCC_APB2RSTR_TIM16RST
#  define TIMCLK_TIM17     STM32_TIM17_CLKIN
#  define TIMRCCEN_TIM17   STM32_RCC_APB2ENR
#  define TIMEN_TIM17      RCC_APB2ENR_TIM17EN
#  define TIMRCCRST_TIM17  STM32_RCC_APB2RSTR
#  define TIMRST_TIM17     RCC_APB2RSTR_TIM17RST
#  define TIMCLK_TIM18     STM32_TIM18_CLKIN
#  define TIMRCCEN_TIM18   STM32_RCC_APB1ENR
#  define TIMEN_TIM18      RCC_APB1ENR_TIM18EN
#  define TIMRCCRST_TIM18  STM32_RCC_APB1RSTR
#  define TIMRST_TIM18     RCC_APB1RSTR_TIM18RST
#  define TIMCLK_TIM19     STM32_TIM19_CLKIN
#  define TIMRCCEN_TIM19   STM32_RCC_APB2ENR
#  define TIMEN_TIM19      RCC_APB2ENR_TIM19EN
#  define TIMRCCRST_TIM19  STM32_RCC_APB2RSTR
#  define TIMRST_TIM19     RCC_APB2RSTR_TIM19RST
#else
#  define TIMCLK_TIM1      STM32_TIM1_CLKIN
#  define TIMRCCEN_TIM1    STM32_RCC_APB2ENR
#  define TIMEN_TIM1       RCC_APB2ENR_TIM1EN
#  define TIMRCCRST_TIM1   STM32_RCC_APB2RSTR
#  define TIMRST_TIM1      RCC_APB2RSTR_TIM1RST
#  define TIMCLK_TIM2      STM32_TIM2_CLKIN
#  define TIMRCCEN_TIM2    STM32_RCC_APB1ENR
#  define TIMEN_TIM2       RCC_APB1ENR_TIM2EN
#  define TIMRCCRST_TIM2   STM32_RCC_APB1RSTR
#  define TIMRST_TIM2      RCC_APB1RSTR_TIM2RST
#  define TIMCLK_TIM3      STM32_TIM3_CLKIN
#  define TIMRCCEN_TIM3    STM32_RCC_APB1ENR
#  define TIMEN_TIM3       RCC_APB1ENR_TIM3EN
#  define TIMRCCRST_TIM3   STM32_RCC_APB1RSTR
#  define TIMRST_TIM3      RCC_APB1RSTR_TIM3RST
#  define TIMCLK_TIM4      STM32_TIM4_CLKIN
#  define TIMRCCEN_TIM4    STM32_RCC_APB1ENR
#  define TIMEN_TIM4       RCC_APB1ENR_TIM4EN
#  define TIMRCCRST_TIM4   STM32_RCC_APB1RSTR
#  define TIMRST_TIM4      RCC_APB1RSTR_TIM4RST
#  define TIMCLK_TIM5      STM32_TIM5_CLKIN
#  define TIMRCCEN_TIM5    STM32_RCC_APB1ENR
#  define TIMEN_TIM5       RCC_APB1ENR_TIM5EN
#  define TIMRCCRST_TIM5   STM32_RCC_APB1RSTR
#  define TIMRST_TIM5      RCC_APB1RSTR_TIM5RST
#  define TIMCLK_TIM8      STM32_TIM8_CLKIN
#  define TIMRCCEN_TIM8    STM32_RCC_APB2ENR
#  define TIMEN_TIM8       RCC_APB2ENR_TIM8EN
#  define TIMRCCRST_TIM8   STM32_RCC_APB2RSTR
#  define TIMRST_TIM8      RCC_APB2RSTR_TIM8RST
#  define TIMCLK_TIM9      STM32_TIM9_CLKIN
#  define TIMRCCEN_TIM9    STM32_RCC_APB2ENR
#  define TIMEN_TIM9       RCC_APB2ENR_TIM9EN
#  define TIMRCCRST_TIM9   STM32_RCC_APB2RSTR
#  define TIMRST_TIM9      RCC_APB2RSTR_TIM9RST
#  define TIMCLK_TIM10     STM32_TIM10_CLKIN
#  define TIMRCCEN_TIM10   STM32_RCC_APB2ENR
#  define TIMEN_TIM10      RCC_APB2ENR_TIM10EN
#  define TIMRCCRST_TIM10  STM32_RCC_APB2RSTR
#  define TIMRST_TIM10     RCC_APB2RSTR_TIM10RST
#  define TIMCLK_TIM11     STM32_TIM11_CLKIN
#  define TIMRCCEN_TIM11   STM32_RCC_APB2ENR
#  define TIMEN_TIM11      RCC_APB2ENR_TIM11EN
#  define TIMRCCRST_TIM11  STM32_RCC_APB2RSTR
#  define TIMRST_TIM11     RCC_APB2RSTR_TIM11RST
#  define TIMCLK_TIM12     STM32_TIM12_CLKIN
#  define TIMRCCEN_TIM12   STM32_RCC_APB1ENR
#  define TIMEN_TIM12      RCC_APB1ENR_TIM12EN
#  define TIMRCCRST_TIM12  STM32_RCC_APB1RSTR
#  define TIMRST_TIM12     RCC_APB1RSTR_TIM12RST
#  define TIMCLK_TIM13     STM32_TIM13_CLKIN
#  define TIMRCCEN_TIM13   STM32_RCC_APB1ENR
#  define TIMEN_TIM13      RCC_APB1ENR_TIM13EN
#  define TIMRCCRST_TIM13  STM32_RCC_APB1RSTR
#  define TIMRST_TIM13     RCC_APB1RSTR_TIM13RST
#  define TIMCLK_TIM14     STM32_TIM14_CLKIN
#  define TIMRCCEN_TIM14   STM32_RCC_APB1ENR
#  define TIMEN_TIM14      RCC_APB1ENR_TIM14EN
#  define TIMRCCRST_TIM14  STM32_RCC_APB1RSTR
#  define TIMRST_TIM14     RCC_APB1RSTR_TIM14RST
#  define TIMCLK_TIM15     STM32_TIM15_CLKIN
#  define TIMRCCEN_TIM15   STM32_RCC_APB1ENR
#  define TIMEN_TIM15      RCC_APB1ENR_TIM15EN
#  define TIMRCCRST_TIM15  STM32_RCC_APB1RSTR
#  define TIMRST_TIM15     RCC_APB1RSTR_TIM15RST
#  define TIMCLK_TIM16     STM32_TIM16_CLKIN
#  define TIMRCCEN_TIM16   STM32_RCC_APB1ENR
#  define TIMEN_TIM16      RCC_APB1ENR_TIM16EN
#  define TIMRCCRST_TIM16  STM32_RCC_APB1RSTR
#  define TIMRST_TIM16     RCC_APB1RSTR_TIM16RST
#  define TIMCLK_TIM17     STM32_TIM17_CLKIN
#  define TIMRCCEN_TIM17   STM32_RCC_APB1ENR
#  define TIMEN_TIM17      RCC_APB1ENR_TIM17EN
#  define TIMRCCRST_TIM17  STM32_RCC_APB1RSTR
#  define TIMRST_TIM17     RCC_APB1RSTR_TIM17RST
#endif

/* Default GPIO pins state */

#if defined(CONFIG_STM32_STM32F10XX)
#  define PINCFG_DEFAULT (GPIO_INPUT | GPIO_CNF_INFLOAT | GPIO_MODE_INPUT)
#elif defined(CONFIG_STM32_STM32F20XX) ||         \
    defined(CONFIG_STM32_STM32F30XX) ||           \
    defined(CONFIG_STM32_STM32F33XX) ||           \
    defined(CONFIG_STM32_STM32F37XX) ||           \
    defined(CONFIG_STM32_STM32F4XXX) ||           \
    defined(CONFIG_STM32_STM32L15XX) ||           \
    defined(CONFIG_STM32_STM32G4XXX)
#  define PINCFG_DEFAULT (GPIO_INPUT | GPIO_FLOAT)
#else
#  error "Unrecognized STM32 chip"
#endif

/* Advanced Timer support
 * NOTE: TIM15-17 are not ADVTIM but they support most of the
 *       ADVTIM functionality.  The main difference is the number of
 *       supported capture/compare.
 */

#if defined(CONFIG_STM32_TIM1_PWM) || defined(CONFIG_STM32_TIM8_PWM) || \
    defined(CONFIG_STM32_TIM15_PWM) || defined(CONFIG_STM32_TIM16_PWM) || \
    defined(CONFIG_STM32_TIM17_PWM)
#  define HAVE_ADVTIM
#else
#  undef HAVE_ADVTIM
#endif

/* TRGO/TRGO2 support */

#ifdef CONFIG_STM32_PWM_TRGO
#  define HAVE_TRGO
#endif

/* Break support */

#if defined(CONFIG_STM32_TIM1_BREAK1) || defined(CONFIG_STM32_TIM1_BREAK2) || \
    defined(CONFIG_STM32_TIM8_BREAK1) || defined(CONFIG_STM32_TIM8_BREAK2) || \
    defined(CONFIG_STM32_TIM15_BREAK1) || defined(CONFIG_STM32_TIM16_BREAK1) || \
    defined(CONFIG_STM32_TIM17_BREAK1)
#  defined HAVE_BREAK
#endif

/* Debug ********************************************************************/

#ifdef CONFIG_DEBUG_PWM_INFO
#  define pwm_dumpgpio(p,m) stm32_dumpgpio(p,m)
#else
#  define pwm_dumpgpio(p,m)
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

