apache/nuttx/arch/arm/src/common/stm32/stm32_pwm_m3m4_v1v2v3.c
#ifdef CONFIG_STM32_PWM_LL_OPS
static const struct stm32_pwm_ops_s g_llpwmops =
{
  .configure       = pwm_configure,
  .soft_break      = pwm_soft_break,
  .ccr_update      = pwm_ccr_update,
  .mode_update     = pwm_mode_configure,
  .ccr_get         = pwm_ccr_get,
  .arr_update      = pwm_arr_update,
  .arr_get         = pwm_arr_get,
#ifdef HAVE_ADVTIM
  .rcr_update      = pwm_rcr_update,
#endif
  .rcr_get         = pwm_rcr_get,
#ifdef HAVE_TRGO
  .trgo_set        = pwm_trgo_configure,
#endif
  .outputs_enable  = pwm_outputs_enable,
  .soft_update     = pwm_soft_update,
  .freq_update     = pwm_frequency_update,
  .tim_enable      = pwm_timer_enable,
#  ifdef CONFIG_DEBUG_PWM_INFO
  .dump_regs       = pwm_dumpregs,
#  endif
#  ifdef HAVE_PWM_COMPLEMENTARY
  .dt_update       = pwm_deadtime_update,
#  endif
};
#endif

#ifdef CONFIG_STM32_TIM1_PWM

static struct stm32_pwmchan_s g_pwm1channels[] =
{
  /* TIM1 has 4 channels, 4 complementary */

#ifdef CONFIG_STM32_TIM1_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM1_CH1MODE,
#ifdef HAVE_BREAK
    .brk =
    {
#ifdef CONFIG_STM32_TIM1_BREAK1
      .en1 = 1,
      .pol1 = CONFIG_STM32_TIM1_BRK1POL,
#endif
#ifdef CONFIG_STM32_TIM1_BREAK2
      .en2 = 1,
      .pol2 = CONFIG_STM32_TIM1_BRK2POL,
      .flt2 = CONFIG_STM32_TIM1_BRK2FLT,
#endif
    },
#endif
#ifdef CONFIG_STM32_TIM1_CH1OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_CH1POL,
      .idle    = CONFIG_STM32_TIM1_CH1IDLE,
      .pincfg  = PWM_TIM1_CH1CFG,
    },
#endif
#ifdef CONFIG_STM32_TIM1_CH1NOUT
    .out2 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_CH1NPOL,
      .idle    = CONFIG_STM32_TIM1_CH1NIDLE,
      .pincfg  = PWM_TIM1_CH1NCFG,
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_TIM1_CHANNEL2
  {
    .channel = 2,
    .mode    = CONFIG_STM32_TIM1_CH2MODE,
#ifdef CONFIG_STM32_TIM1_CH2OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_CH2POL,
      .idle    = CONFIG_STM32_TIM1_CH2IDLE,
      .pincfg  = PWM_TIM1_CH2CFG,
    },
#endif
#ifdef CONFIG_STM32_TIM1_CH2NOUT
    .out2 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_CH2NPOL,
      .idle    = CONFIG_STM32_TIM1_CH2NIDLE,
      .pincfg  = PWM_TIM1_CH2NCFG,
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_TIM1_CHANNEL3
  {
    .channel = 3,
    .mode    = CONFIG_STM32_TIM1_CH3MODE,
#ifdef CONFIG_STM32_TIM1_CH3OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_CH3POL,
      .idle    = CONFIG_STM32_TIM1_CH3IDLE,
      .pincfg  = PWM_TIM1_CH3CFG,
    },
#endif
#ifdef CONFIG_STM32_TIM1_CH3NOUT
    .out2 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_CH3NPOL,
      .idle    = CONFIG_STM32_TIM1_CH3NIDLE,
      .pincfg  = PWM_TIM1_CH3NCFG,
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_TIM1_CHANNEL4
  {
    .channel = 4,
    .mode    = CONFIG_STM32_TIM1_CH4MODE,
#ifdef CONFIG_STM32_TIM1_CH4OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_CH4POL,
      .idle    = CONFIG_STM32_TIM1_CH4IDLE,
      .pincfg  = PWM_TIM1_CH4CFG,
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_TIM1_CHANNEL5
  {
    .channel = 5,
    .mode    = CONFIG_STM32_TIM1_CH5MODE,
#ifdef CONFIG_STM32_TIM1_CH5OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_CH5POL,
      .idle    = CONFIG_STM32_TIM1_CH5IDLE,
      .pincfg  = 0,    /* Not available externally */
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_TIM1_CHANNEL6
  {
    .channel = 6,
    .mode    = CONFIG_STM32_TIM1_CH6MODE,
#ifdef CONFIG_STM32_TIM1_CH6OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM1_CH6POL,
      .idle    = CONFIG_STM32_TIM1_CH6IDLE,
      .pincfg  = 0,    /* Not available externally */
    }
#endif
  }
#endif
};

static struct stm32_pwmtimer_s g_pwm1dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 1,
  .chan_num    = PWM_TIM1_NCHANNELS,
  .channels    = g_pwm1channels,
  .timtype     = TIMTYPE_TIM1,
  .mode        = CONFIG_STM32_TIM1_MODE,
  .lock        = CONFIG_STM32_TIM1_LOCK,
  .t_dts       = CONFIG_STM32_TIM1_TDTS,
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = CONFIG_STM32_TIM1_DEADTIME,
#endif
#if defined(HAVE_TRGO) && defined(STM32_TIM1_TRGO)
  .trgo        = STM32_TIM1_TRGO,
#endif
  .base        = STM32_TIM1_BASE,
  .pclk        = TIMCLK_TIM1,
};
#endif /* CONFIG_STM32_TIM1_PWM */

#ifdef CONFIG_STM32_TIM2_PWM

static struct stm32_pwmchan_s g_pwm2channels[] =
{
  /* TIM2 has 4 channels */

#ifdef CONFIG_STM32_TIM2_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM2_CH1MODE,
#ifdef CONFIG_STM32_TIM2_CH1OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM2_CH1POL,
      .idle    = CONFIG_STM32_TIM2_CH1IDLE,
      .pincfg  = PWM_TIM2_CH1CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM2_CHANNEL2
  {
    .channel = 2,
    .mode    = CONFIG_STM32_TIM2_CH2MODE,
#ifdef CONFIG_STM32_TIM2_CH2OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM2_CH2POL,
      .idle    = CONFIG_STM32_TIM2_CH2IDLE,
      .pincfg  = PWM_TIM2_CH2CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM2_CHANNEL3
  {
    .channel = 3,
    .mode    = CONFIG_STM32_TIM2_CH3MODE,
#ifdef CONFIG_STM32_TIM2_CH3OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM2_CH3POL,
      .idle    = CONFIG_STM32_TIM2_CH3IDLE,
      .pincfg  = PWM_TIM2_CH3CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM2_CHANNEL4
  {
    .channel = 4,
    .mode    = CONFIG_STM32_TIM2_CH4MODE,
#ifdef CONFIG_STM32_TIM2_CH4OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM2_CH4POL,
      .idle    = CONFIG_STM32_TIM2_CH4IDLE,
      .pincfg  = PWM_TIM2_CH4CFG,
    }
#endif
    /* No complementary outputs */
  }
#endif
};

static struct stm32_pwmtimer_s g_pwm2dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 2,
  .chan_num    = PWM_TIM2_NCHANNELS,
  .channels    = g_pwm2channels,
  .timtype     = TIMTYPE_TIM2,
  .mode        = CONFIG_STM32_TIM2_MODE,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO) && defined(STM32_TIM2_TRGO)
  .trgo        = STM32_TIM2_TRGO,
#endif
  .base        = STM32_TIM2_BASE,
  .pclk        = TIMCLK_TIM2,
};
#endif /* CONFIG_STM32_TIM2_PWM */

#ifdef CONFIG_STM32_TIM3_PWM

static struct stm32_pwmchan_s g_pwm3channels[] =
{
  /* TIM3 has 4 channels */

