apache/nuttx/arch/arm/src/common/stm32/stm32_pwm_m3m4_v1v2v3.c
#ifdef CONFIG_STM32_TIM3_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM3_CH1MODE,
#ifdef CONFIG_STM32_TIM3_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM3_CH1POL,
      .idle    = CONFIG_STM32_TIM3_CH1IDLE,
      .pincfg  = PWM_TIM3_CH1CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM3_CHANNEL2
  {
    .channel = 2,
    .mode    = CONFIG_STM32_TIM3_CH2MODE,
#ifdef CONFIG_STM32_TIM3_CH2OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM3_CH2POL,
      .idle    = CONFIG_STM32_TIM3_CH2IDLE,
      .pincfg  = PWM_TIM3_CH2CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM3_CHANNEL3
  {
    .channel = 3,
    .mode    = CONFIG_STM32_TIM3_CH3MODE,
#ifdef CONFIG_STM32_TIM3_CH3OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM3_CH3POL,
      .idle    = CONFIG_STM32_TIM3_CH3IDLE,
      .pincfg  = PWM_TIM3_CH3CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM3_CHANNEL4
  {
    .channel = 4,
    .mode    = CONFIG_STM32_TIM3_CH4MODE,
#ifdef CONFIG_STM32_TIM3_CH4OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM3_CH4POL,
      .idle    = CONFIG_STM32_TIM3_CH4IDLE,
      .pincfg  = PWM_TIM3_CH4CFG,
    }
#endif
    /* No complementary outputs */
  }
#endif
};

static struct stm32_pwmtimer_s g_pwm3dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 3,
  .chan_num    = PWM_TIM3_NCHANNELS,
  .channels    = g_pwm3channels,
  .timtype     = TIMTYPE_TIM3,
  .mode        = CONFIG_STM32_TIM3_MODE,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO) && defined(STM32_TIM3_TRGO)
  .trgo        = STM32_TIM3_TRGO,
#endif
  .base        = STM32_TIM3_BASE,
  .pclk        = TIMCLK_TIM3,
};
#endif /* CONFIG_STM32_TIM3_PWM */

#ifdef CONFIG_STM32_TIM4_PWM

static struct stm32_pwmchan_s g_pwm4channels[] =
{
  /* TIM4 has 4 channels */

#ifdef CONFIG_STM32_TIM4_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM4_CH1MODE,
#ifdef CONFIG_STM32_TIM4_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM4_CH1POL,
      .idle    = CONFIG_STM32_TIM4_CH1IDLE,
      .pincfg  = PWM_TIM4_CH1CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM4_CHANNEL2
  {
    .channel = 2,
    .mode    = CONFIG_STM32_TIM4_CH2MODE,
#ifdef CONFIG_STM32_TIM4_CH2OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM4_CH2POL,
      .idle    = CONFIG_STM32_TIM4_CH2IDLE,
      .pincfg  = PWM_TIM4_CH2CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM4_CHANNEL3
  {
    .channel = 3,
    .mode    = CONFIG_STM32_TIM4_CH3MODE,
#ifdef CONFIG_STM32_TIM4_CH3OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM4_CH3POL,
      .idle    = CONFIG_STM32_TIM4_CH3IDLE,
      .pincfg  = PWM_TIM4_CH3CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM4_CHANNEL4
  {
    .channel = 4,
    .mode    = CONFIG_STM32_TIM4_CH4MODE,
#ifdef CONFIG_STM32_TIM4_CH4OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM4_CH4POL,
      .idle    = CONFIG_STM32_TIM4_CH4IDLE,
      .pincfg  = PWM_TIM4_CH4CFG,
    }
#endif
    /* No complementary outputs */
  }
#endif
};

static struct stm32_pwmtimer_s g_pwm4dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 4,
  .chan_num    = PWM_TIM4_NCHANNELS,
  .channels    = g_pwm4channels,
  .timtype     = TIMTYPE_TIM4,
  .mode        = CONFIG_STM32_TIM4_MODE,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO) && defined(STM32_TIM4_TRGO)
  .trgo        = STM32_TIM4_TRGO,
#endif
  .base        = STM32_TIM4_BASE,
  .pclk        = TIMCLK_TIM4,
};
#endif /* CONFIG_STM32_TIM4_PWM */

#ifdef CONFIG_STM32_TIM5_PWM

static struct stm32_pwmchan_s g_pwm5channels[] =
{
  /* TIM5 has 4 channels */

#ifdef CONFIG_STM32_TIM5_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM5_CH1MODE,
#ifdef CONFIG_STM32_TIM5_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM5_CH1POL,
      .idle    = CONFIG_STM32_TIM5_CH1IDLE,
      .pincfg  = PWM_TIM5_CH1CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM5_CHANNEL2
  {
    .channel = 2,
    .mode    = CONFIG_STM32_TIM5_CH2MODE,
#ifdef CONFIG_STM32_TIM5_CH2OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM5_CH2POL,
      .idle    = CONFIG_STM32_TIM5_CH2IDLE,
      .pincfg  = PWM_TIM5_CH2CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM5_CHANNEL3
  {
    .channel = 3,
    .mode    = CONFIG_STM32_TIM5_CH3MODE,
#ifdef CONFIG_STM32_TIM5_CH3OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM5_CH3POL,
      .idle    = CONFIG_STM32_TIM5_CH3IDLE,
      .pincfg  = PWM_TIM5_CH3CFG,
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_TIM5_CHANNEL4
  {
    .channel = 4,
    .mode    = CONFIG_STM32_TIM5_CH4MODE,
#ifdef CONFIG_STM32_TIM5_CH4OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM5_CH4POL,
      .idle    = CONFIG_STM32_TIM5_CH4IDLE,
      .pincfg  = PWM_TIM5_CH4CFG,
    }
#endif
  },
#endif
};

static struct stm32_pwmtimer_s g_pwm5dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 5,
  .chan_num    = PWM_TIM5_NCHANNELS,
  .channels    = g_pwm5channels,
  .timtype     = TIMTYPE_TIM5,
  .mode        = CONFIG_STM32_TIM5_MODE,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO) && defined(STM32_TIM5_TRGO)
  .trgo        = STM32_TIM5_TRGO,
#endif
  .base        = STM32_TIM5_BASE,
  .pclk        = TIMCLK_TIM5,
};
#endif /* CONFIG_STM32_TIM5_PWM */

#ifdef CONFIG_STM32_TIM8_PWM

static struct stm32_pwmchan_s g_pwm8channels[] =
{
  /* TIM8 has 4 channels, 4 complementary */

#ifdef CONFIG_STM32_TIM8_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM8_CH1MODE,
#ifdef HAVE_BREAK
    .brk =
    {
#ifdef CONFIG_STM32_TIM8_BREAK1
      .en1 = 1,
      .pol1 = CONFIG_STM32_TIM8_BRK1POL,
#endif
#ifdef CONFIG_STM32_TIM8_BREAK2
      .en2 = 1,
      .pol2 = CONFIG_STM32_TIM8_BRK2POL,
      .flt2 = CONFIG_STM32_TIM8_BRK2FLT,
#endif
    },
#endif
#ifdef CONFIG_STM32_TIM8_CH1OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_CH1POL,
      .idle    = CONFIG_STM32_TIM8_CH1IDLE,
      .pincfg  = PWM_TIM8_CH1CFG,
    },
#endif
#ifdef CONFIG_STM32_TIM8_CH1NOUT
    .out2 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_CH1NPOL,
      .idle    = CONFIG_STM32_TIM8_CH1NIDLE,
      .pincfg  = PWM_TIM8_CH1NCFG,
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_TIM8_CHANNEL2
  {
    .channel = 2,
    .mode    = CONFIG_STM32_TIM8_CH2MODE,
#ifdef CONFIG_STM32_TIM8_CH2OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_CH2POL,
      .idle    = CONFIG_STM32_TIM8_CH2IDLE,
      .pincfg  = PWM_TIM8_CH2CFG,
    },
#endif
#ifdef CONFIG_STM32_TIM8_CH2NOUT
    .out2 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_CH2NPOL,
      .idle    = CONFIG_STM32_TIM8_CH2NIDLE,
      .pincfg  = PWM_TIM8_CH2NCFG,
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_TIM8_CHANNEL3
  {
    .channel = 3,
    .mode    = CONFIG_STM32_TIM8_CH3MODE,
#ifdef CONFIG_STM32_TIM8_CH3OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_CH3POL,
      .idle    = CONFIG_STM32_TIM8_CH3IDLE,
      .pincfg  = PWM_TIM8_CH3CFG,
    },
#endif
#ifdef CONFIG_STM32_TIM8_CH3NOUT
    .out2 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_CH3NPOL,
      .idle    = CONFIG_STM32_TIM8_CH3NIDLE,
      .pincfg  = PWM_TIM8_CH3NCFG,
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_TIM8_CHANNEL4
  {
    .channel = 4,
    .mode    = CONFIG_STM32_TIM8_CH4MODE,
#ifdef CONFIG_STM32_TIM8_CH4OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_CH4POL,
      .idle    = CONFIG_STM32_TIM8_CH4IDLE,
      .pincfg  = PWM_TIM8_CH4CFG,
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_TIM8_CHANNEL5
  {
    .channel = 5,
    .mode    = CONFIG_STM32_TIM8_CH5MODE,
#ifdef CONFIG_STM32_TIM8_CH5OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_CH5POL,
      .idle    = CONFIG_STM32_TIM8_CH5IDLE,
      .pincfg  = 0,    /* Not available externally */
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_TIM8_CHANNEL6
  {
    .channel = 6,
    .mode    = CONFIG_STM32_TIM8_CH6MODE,
#ifdef CONFIG_STM32_TIM8_CH6OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM8_CH6POL,
      .idle    = CONFIG_STM32_TIM8_CH6IDLE,
      .pincfg  = 0,    /* Not available externally */
    }
#endif
  }
#endif
};

