apache/nuttx/arch/arm/src/common/stm32/stm32_pwm_m3m4_v1v2v3.c
static struct stm32_pwmtimer_s g_pwm8dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 8,
  .chan_num    = PWM_TIM8_NCHANNELS,
  .channels    = g_pwm8channels,
  .timtype     = TIMTYPE_TIM8,
  .mode        = CONFIG_STM32_TIM8_MODE,
  .lock        = CONFIG_STM32_TIM8_LOCK,
  .t_dts       = CONFIG_STM32_TIM8_TDTS,
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = CONFIG_STM32_TIM8_DEADTIME,
#endif
#if defined(HAVE_TRGO) && defined(STM32_TIM8_TRGO)
  .trgo        = STM32_TIM8_TRGO,
#endif
  .base        = STM32_TIM8_BASE,
  .pclk        = TIMCLK_TIM8,
};
#endif /* CONFIG_STM32_TIM8_PWM */

#ifdef CONFIG_STM32_TIM9_PWM

static struct stm32_pwmchan_s g_pwm9channels[] =
{
  /* TIM9 has 2 channels */

#ifdef CONFIG_STM32_TIM9_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM9_CH1MODE,
#ifdef CONFIG_STM32_TIM9_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM9_CH1POL,
      .idle    = CONFIG_STM32_TIM9_CH1IDLE,
      .pincfg  = PWM_TIM9_CH1CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM9_CHANNEL2
  {
    .channel = 2,
    .mode    = CONFIG_STM32_TIM9_CH2MODE,
#ifdef CONFIG_STM32_TIM9_CH2OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM9_CH2POL,
      .idle    = CONFIG_STM32_TIM9_CH2IDLE,
      .pincfg  = PWM_TIM9_CH2CFG,
    }
#endif
    /* No complementary outputs */
  }
#endif
};

static struct stm32_pwmtimer_s g_pwm9dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 9,
  .chan_num    = PWM_TIM9_NCHANNELS,
  .channels    = g_pwm9channels,
  .timtype     = TIMTYPE_TIM9,
  .mode        = STM32_TIMMODE_COUNTUP,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO)
  .trgo        = 0,             /* TRGO not supported for TIM9 */
#endif
  .base        = STM32_TIM9_BASE,
  .pclk        = TIMCLK_TIM9,
};
#endif /* CONFIG_STM32_TIM9_PWM */

#ifdef CONFIG_STM32_TIM10_PWM

static struct stm32_pwmchan_s g_pwm10channels[] =
{
  /* TIM10 has 1 channel */

#ifdef CONFIG_STM32_TIM10_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM10_CH1MODE,
#ifdef CONFIG_STM32_TIM10_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM10_CH1POL,
      .idle    = CONFIG_STM32_TIM10_CH1IDLE,
      .pincfg  = PWM_TIM10_CH1CFG,
    }
#endif
    /* No complementary outputs */
  }
#endif
};

static struct stm32_pwmtimer_s g_pwm10dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 10,
  .chan_num    = PWM_TIM10_NCHANNELS,
  .channels    = g_pwm10channels,
  .timtype     = TIMTYPE_TIM10,
  .mode        = STM32_TIMMODE_COUNTUP,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO)
  .trgo        = 0,             /* TRGO not supported for TIM10 */
#endif
  .base        = STM32_TIM10_BASE,
  .pclk        = TIMCLK_TIM10,
};
#endif /* CONFIG_STM32_TIM10_PWM */

#ifdef CONFIG_STM32_TIM11_PWM

static struct stm32_pwmchan_s g_pwm11channels[] =
{
  /* TIM11 has 1 channel */

#ifdef CONFIG_STM32_TIM11_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM11_CH1MODE,
#ifdef CONFIG_STM32_TIM11_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM11_CH1POL,
      .idle    = CONFIG_STM32_TIM11_CH1IDLE,
      .pincfg  = PWM_TIM11_CH1CFG,
    }
#endif
    /* No complementary outputs */
  }
#endif
};

static struct stm32_pwmtimer_s g_pwm11dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 11,
  .chan_num    = PWM_TIM11_NCHANNELS,
  .channels    = g_pwm11channels,
  .timtype     = TIMTYPE_TIM11,
  .mode        = STM32_TIMMODE_COUNTUP,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO)
  .trgo        = 0,             /* TRGO not supported for TIM11 */
#endif
  .base        = STM32_TIM11_BASE,
  .pclk        = TIMCLK_TIM11,
};
#endif /* CONFIG_STM32_TIM11_PWM */

#ifdef CONFIG_STM32_TIM12_PWM

static struct stm32_pwmchan_s g_pwm12channels[] =
{
  /* TIM12 has 2 channels */

#ifdef CONFIG_STM32_TIM12_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM12_CH1MODE,
#ifdef CONFIG_STM32_TIM12_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM12_CH1POL,
      .idle    = CONFIG_STM32_TIM12_CH1IDLE,
      .pincfg  = PWM_TIM12_CH1CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM12_CHANNEL2
  {
    .channel = 2,
    .mode    = CONFIG_STM32_TIM12_CH2MODE,
#ifdef CONFIG_STM32_TIM12_CH2OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM12_CH2POL,
      .idle    = CONFIG_STM32_TIM12_CH2IDLE,
      .pincfg  = PWM_TIM12_CH2CFG,
    }
#endif
    /* No complementary outputs */
  }
#endif
};

static struct stm32_pwmtimer_s g_pwm12dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 12,
  .chan_num    = PWM_TIM12_NCHANNELS,
  .channels    = g_pwm12channels,
  .timtype     = TIMTYPE_TIM12,
  .mode        = STM32_TIMMODE_COUNTUP,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO)
  .trgo        = 0,             /* TRGO not supported for TIM12 */
#endif
  .base        = STM32_TIM12_BASE,
  .pclk        = TIMCLK_TIM12,
};
#endif /* CONFIG_STM32_TIM12_PWM */

